Map<String, List<String>> cocktails = {
  'Маргарита': ['текила', 'трипл сек', 'сок лайма', 'соль', 'лёд'],
  'Мохито': ['ром', 'сахар', 'мята', 'сок лайма', 'содовая', 'лёд'],
  'Пина Колада': ['ром', 'сок ананасовый', 'кокосовый сироп', 'лёд'],
  'Космополитен': ['водка', 'трипл сек', 'сок клюквенный', 'сок лайма', 'лёд'],
  'Мартини': ['джин', 'вермут', 'лёд', 'оливки'],
  'Дайкири': ['ром', 'сок лайма', 'сахар', 'лёд'],
  'Манхэттен': ['виски', 'вермут', 'биттер', 'вишня', 'лёд'],
  'Секс на пляже': [
    'водка',
    'ликер персиковый',
    'сок клюквенный',
    'сок апельсиновый',
    'лёд'
  ],
  'Текила Санрайз': ['текила', 'сок апельсиновый', 'гренадин', 'лёд'],
  'Белый Русский': ['водка', 'кофейный ликер', 'сливки', 'лёд'],
  'Черный Русский': ['водка', 'кофейный ликер', 'лёд'],
  'Май Тай': [
    'ром',
    'трипл сек',
    'сок лайма',
    'сироп миндальный',
    'гренадин',
    'лёд'
  ],
  'Б-52': ['кофейный ликер', 'трипл сек', 'ирландский ликер'],
  'Голубая Лагуна': ['водка', 'сироп блю-кюрасао', 'спрайт', 'лёд'],
  'Апельсиновый Крест': ['водка', 'сок апельсиновый', 'гренадин', 'лёд'],
  'Виски Сауэр': ['виски', 'сок лимона', 'сахарный сироп', 'белок яйца', 'лёд'],
  'Апероль Шприц': ['апероль', 'просекко', 'содовая', 'лёд', 'апельсин'],
  'Голубая Маргарита': [
    'текила',
    'трипл сек',
    'сироп блю-кюрасао',
    'сок лайма',
    'лёд'
  ],
  'Лонг-Айленд Айс Ти': [
    'водка',
    'джин',
    'ром',
    'трипл сек',
    'текила',
    'сок лимона',
    'кола',
    'лёд'
  ]
};
