Map<String, Map<String, dynamic>> cocktails = {
  'Мохито': {
    'Ingredients': ['Ром', 'Сахар', 'Мята', 'Сок лайма', 'Содовая', 'Лёд'],
    'Recipe':
        'Разотрите мяту с сахаром и соком лайма в стакане. Добавьте лёд, залейте ромом и долейте содовую. Перемешайте.'
  },
  'Пина Колада': {
    'Ingredients': ['Ром', 'Сок ананасовый', 'Кокосовый сироп', 'Лёд'],
    'Recipe':
        'Смешайте ром, ананасовый сок и кокосовый сироп в блендере с льдом. Перелейте в бокал и украсьте ананасом.'
  },
  'Космополитен': {
    'Ingredients': ['Водка', 'Трипл сек', 'Сок клюквенный', 'Сок лайма', 'Лёд'],
    'Recipe':
        'Смешайте водку, трипл сек, клюквенный сок и сок лайма в шейкере с льдом. Процедите в бокал для мартини.'
  },
  'Манхэттен': {
    'Ingredients': ['Виски', 'Вермут', 'Биттер', 'Вишня', 'Лёд'],
    'Recipe':
        'Смешайте виски, вермут и биттер в стакане для смешивания с льдом. Процедите в бокал и украсьте вишней.'
  },
  'Текила Санрайз': {
    'Ingredients': ['Текила', 'Сок апельсиновый', 'Гренадин', 'Лёд'],
    'Recipe':
        'Наполните стакан льдом. Влейте текилу и апельсиновый сок, затем аккуратно добавьте гренадин, чтобы создать эффект "восхода солнца".'
  },
  'Черный Русский': {
    'Ingredients': ['Водка', 'Кофейный ликер', 'Лёд'],
    'Recipe': 'Смешайте водку и кофейный ликер в стакане с льдом.'
  },
  'Апероль Шприц': {
    'Ingredients': ['Апероль', 'Просекко', 'Содовая', 'Лёд', 'Апельсин'],
    'Recipe':
        'Наполните бокал льдом. Добавьте апероль, просекко и немного содовой. Украсьте ломтиком апельсина.'
  },
};
