Map<String, Map<String, dynamic>> cocktails = {
  'Мохито': {
    'Ingredients': ['ром', 'сахар', 'мята', 'сок лайма', 'содовая', 'лёд'],
    'Recipe':
        'Разотрите мяту с сахаром и соком лайма в стакане. Добавьте лёд, залейте ромом и долейте содовую. Перемешайте.'
  },
  'Пина Колада': {
    'Ingredients': ['ром', 'сок ананасовый', 'кокосовый сироп', 'лёд'],
    'Recipe':
        'Смешайте ром, ананасовый сок и кокосовый сироп в блендере с льдом. Перелейте в бокал и украсьте ананасом.'
  },
  'Космополитен': {
    'Ingredients': ['водка', 'трипл сек', 'сок клюквенный', 'сок лайма', 'лёд'],
    'Recipe':
        'Смешайте водку, трипл сек, клюквенный сок и сок лайма в шейкере с льдом. Процедите в бокал для мартини.'
  },
  'Манхэттен': {
    'Ingredients': ['виски', 'вермут', 'биттер', 'вишня', 'лёд'],
    'Recipe':
        'Смешайте виски, вермут и биттер в стакане для смешивания с льдом. Процедите в бокал и украсьте вишней.'
  },
  'Текила Санрайз': {
    'Ingredients': ['текила', 'сок апельсиновый', 'гренадин', 'лёд'],
    'Recipe':
        'Наполните стакан льдом. Влейте текилу и апельсиновый сок, затем аккуратно добавьте гренадин, чтобы создать эффект "восхода солнца".'
  },
  'Черный Русский': {
    'Ingredients': ['водка', 'кофейный ликер', 'лёд'],
    'Recipe': 'Смешайте водку и кофейный ликер в стакане с льдом.'
  },
  'Апероль Шприц': {
    'Ingredients': ['апероль', 'просекко', 'содовая', 'лёд', 'апельсин'],
    'Recipe':
        'Наполните бокал льдом. Добавьте апероль, просекко и немного содовой. Украсьте ломтиком апельсина.'
  },
};
