Map<String, Map<String, dynamic>> cocktails = {
  'Маргарита': {
    'Ingredients': ['текила', 'трипл сек', 'сок лайма', 'соль', 'лёд'],
    'Recipe':
        'Смешайте текилу, трипл сек и сок лайма в шейкере с льдом. Встряхните и процедите в бокал, края которого обсыпаны солью.'
  },
  'Мохито': {
    'Ingredients': ['ром', 'сахар', 'мята', 'сок лайма', 'содовая', 'лёд'],
    'Recipe':
        'Разотрите мяту с сахаром и соком лайма в стакане. Добавьте лёд, залейте ромом и долейте содовую. Перемешайте.'
  },
  'Пина Колада': {
    'Ingredients': ['ром', 'сок ананасовый', 'кокосовый сироп', 'лёд'],
    'Recipe':
        'Смешайте ром, ананасовый сок и кокосовый сироп в блендере с льдом. Перелейте в бокал и украсьте ананасом.'
  },
  'Космополитен': {
    'Ingredients': ['водка', 'трипл сек', 'сок клюквенный', 'сок лайма', 'лёд'],
    'Recipe':
        'Смешайте водку, трипл сек, клюквенный сок и сок лайма в шейкере с льдом. Процедите в бокал для мартини.'
  },
  'Мартини': {
    'Ingredients': ['джин', 'вермут', 'лёд', 'оливки'],
    'Recipe':
        'Смешайте джин и вермут в стакане для смешивания с льдом. Процедите в охлажденный бокал и украсьте оливкой.'
  },
  'Дайкири': {
    'Ingredients': ['ром', 'сок лайма', 'сахар', 'лёд'],
    'Recipe':
        'Смешайте ром, сок лайма и сахар в шейкере с льдом. Встряхните и процедите в бокал.'
  },
  'Манхэттен': {
    'Ingredients': ['виски', 'вермут', 'биттер', 'вишня', 'лёд'],
    'Recipe':
        'Смешайте виски, вермут и биттер в стакане для смешивания с льдом. Процедите в бокал и украсьте вишней.'
  },
  'Текила Санрайз': {
    'Ingredients': ['текила', 'сок апельсиновый', 'гренадин', 'лёд'],
    'Recipe':
        'Наполните стакан льдом. Влейте текилу и апельсиновый сок, затем аккуратно добавьте гренадин, чтобы создать эффект "восхода солнца".'
  },
  'Белый Русский': {
    'Ingredients': ['водка', 'кофейный ликер', 'сливки', 'лёд'],
    'Recipe':
        'Смешайте водку и кофейный ликер в стакане с льдом. Добавьте сливки и аккуратно перемешайте.'
  },
  'Черный Русский': {
    'Ingredients': ['водка', 'кофейный ликер', 'лёд'],
    'Recipe': 'Смешайте водку и кофейный ликер в стакане с льдом.'
  },
  'Б-52': {
    'Ingredients': ['кофейный ликер', 'трипл сек', 'ирландский ликер'],
    'Recipe':
        'Налейте кофейный ликер, трипл сек и ирландский ликер слоями в шот. Подайте как есть или подожгите перед подачей.'
  },
  'Голубая Лагуна': {
    'Ingredients': ['водка', 'сироп блю-кюрасао', 'спрайт', 'лёд'],
    'Recipe':
        'Смешайте водку и сироп блю-кюрасао в стакане с льдом. Долейте спрайт и украсьте лимоном.'
  },
  'Апероль Шприц': {
    'Ingredients': ['апероль', 'просекко', 'содовая', 'лёд', 'апельсин'],
    'Recipe':
        'Наполните бокал льдом. Добавьте апероль, просекко и немного содовой. Украсьте ломтиком апельсина.'
  },
};
